// export a an array of json object with field (id, name)
export const QUEST_FILTER_SKILL_ARRAY = [
  {
    id: 2270,
    name: "고고학",
  },
  {
    id: 2275,
    name: "낚시",
  },
  {
    id: 2277,
    name: "돛 조종",
  },
  {
    id: 2278,
    name: "미술",
  },
  {
    id: 2280,
    name: "보물 감정",
  },
  {
    id: 2281,
    name: "생물학",
  },
  {
    id: 2282,
    name: "생존",
  },
  {
    id: 2283,
    name: "생태 조사",
  },
  {
    id: 2284,
    name: "인식",
  },
  {
    id: 2285,
    name: "자물쇠 따기",
  },
  {
    id: 2286,
    name: "조달",
  },
  {
    id: 2287,
    name: "종교학",
  },
  {
    id: 2289,
    name: "지리학",
  },
  {
    id: 2290,
    name: "채집",
  },
  {
    id: 2292,
    name: "탐색",
  },
  {
    id: 2293,
    name: "행군",
  },
  {
    id: 2294,
    name: "가축 거래",
  },
  {
    id: 2295,
    name: "경계",
  },
  {
    id: 2297,
    name: "공예",
  },
  {
    id: 2298,
    name: "공예품 거래",
  },
  {
    id: 2300,
    name: "귀금속 거래",
  },
  {
    id: 2301,
    name: "기호품 거래",
  },
  {
    id: 2306,
    name: "보관",
  },
  {
    id: 2307,
    name: "보석 거래",
  },
  {
    id: 2308,
    name: "봉제",
  },
  {
    id: 2309,
    name: "사교",
  },
  {
    id: 2313,
    name: "운용",
  },
  {
    id: 2314,
    name: "의약품 거래",
  },
  {
    id: 2316,
    name: "조리",
  },
  {
    id: 2317,
    name: "주류 거래",
  },
  {
    id: 2318,
    name: "주조",
  },
  {
    id: 2322,
    name: "향신료 거래",
  },
  {
    id: 2323,
    name: "회계",
  },
  {
    id: 2324,
    name: "감시",
  },
  {
    id: 2325,
    name: "검술",
  },
  {
    id: 2326,
    name: "관통",
  },
  {
    id: 2328,
    name: "노 젓기",
  },
  {
    id: 2329,
    name: "돌격",
  },
  {
    id: 2333,
    name: "수리",
  },
  {
    id: 2334,
    name: "수탈",
  },
  {
    id: 2335,
    name: "수평사격",
  },
  {
    id: 2336,
    name: "외과의술",
  },
  {
    id: 2338,
    name: "응급처치",
  },
  {
    id: 2339,
    name: "전술",
  },
  {
    id: 2344,
    name: "총격",
  },
  {
    id: 2345,
    name: "탄도학",
  },
  {
    id: 2346,
    name: "통솔",
  },
  {
    id: 2347,
    name: "포술",
  },
  {
    id: 2348,
    name: "회피",
  },
  {
    id: 2349,
    name: "고대 이집트어",
  },
  {
    id: 2350,
    name: "그리스어",
  },
  {
    id: 2351,
    name: "네덜란드어",
  },
  {
    id: 2352,
    name: "노르웨이어",
  },
  {
    id: 2353,
    name: "독일어",
  },
  {
    id: 2354,
    name: "라틴어",
  },
  {
    id: 2355,
    name: "서아프리카어",
  },
  {
    id: 2356,
    name: "스와힐리어",
  },
  {
    id: 2357,
    name: "스페인어",
  },
  {
    id: 2358,
    name: "슬라브어",
  },
  {
    id: 2359,
    name: "아라비아어",
  },
  {
    id: 2360,
    name: "영어",
  },
  {
    id: 2361,
    name: "이탈리아어",
  },
  {
    id: 2362,
    name: "인도어",
  },
  {
    id: 2363,
    name: "켈트어",
  },
  {
    id: 2364,
    name: "터키어",
  },
  {
    id: 2365,
    name: "포르투갈어",
  },
  {
    id: 2366,
    name: "프랑스어",
  },
  {
    id: 2367,
    name: "헤브라이어",
  },
  {
    id: 2368,
    name: "페르시아어",
  },
  {
    id: 2429,
    name: "마야어",
  },
  {
    id: 2430,
    name: "항해기술",
  },
  {
    id: 2431,
    name: "던지기 기술",
  },
  {
    id: 2432,
    name: "관리기술",
  },
  {
    id: 2433,
    name: "응용검술",
  },
  {
    id: 2434,
    name: "병기기술",
  },
  {
    id: 2435,
    name: "저격술",
  },
  {
    id: 2436,
    name: "연금술",
  },
  {
    id: 2438,
    name: "크메르어",
  },
  {
    id: 2439,
    name: "말레이 타갈로그어",
  },
  {
    id: 2440,
    name: "태국 미얀마어",
  },
  {
    id: 2442,
    name: "나우아틀어",
  },
  {
    id: 2444,
    name: "인양",
  },
  {
    id: 2448,
    name: "오세아니아어",
  },
  {
    id: 2449,
    name: "케추아어",
  },
  {
    id: 2451,
    name: "조선어",
  },
  {
    id: 2452,
    name: "상품지식",
  },
  {
    id: 2453,
    name: "함정",
  },
  {
    id: 2454,
    name: "중국어",
  },
  {
    id: 2455,
    name: "일본어",
  },
  {
    id: 2457,
    name: "북미어",
  },
  {
    id: 59426,
    name: "북극어",
  },
  {
    id: 137755,
    name: "천문학",
  },
  {
    id: 1518281,
    name: "조교",
  },
];

// id 값은 대충 아무렇게나 넣음. 주의필요
export const QUEST_FILTER_LOCATION_ARRAY = [
  {
    id: 1,
    name: "간디아",
  },
  {
    id: 2,
    name: "그로닝겐",
  },
  {
    id: 3,
    name: "길드 개척도시",
  },
  {
    id: 4,
    name: "나폴리",
  },
  {
    id: 5,
    name: "런던",
  },
  {
    id: 6,
    name: "리마",
  },
  {
    id: 7,
    name: "리스본",
  },
  {
    id: 8,
    name: "리우데자네이루",
  },
  {
    id: 9,
    name: "마닐라",
  },
  {
    id: 10,
    name: "마르세이유",
  },
  {
    id: 11,
    name: "베네치아",
  },
  {
    id: 12,
    name: "부산",
  },
  {
    id: 13,
    name: "사그레스",
  },
  {
    id: 14,
    name: "산토도밍고",
  },
  {
    id: 15,
    name: "산티아고",
  },
  {
    id: 16,
    name: "상트 페테르부르크",
  },
  {
    id: 17,
    name: "샌프란시스코",
  },
  {
    id: 18,
    name: "세비야",
  },
  {
    id: 19,
    name: "세우타",
  },
  {
    id: 20,
    name: "세인트조지스",
  },
  {
    id: 21,
    name: "스톡홀름",
  },
  {
    id: 22,
    name: "시라쿠사",
  },
  {
    id: 23,
    name: "아덴",
  },
  {
    id: 24,
    name: "아크로폴리스",
  },
  {
    id: 25,
    name: "아테네",
  },
  {
    id: 26,
    name: "안평",
  },
  {
    id: 27,
    name: "알렉산드리아",
  },
  {
    id: 28,
    name: "암스테르담",
  },
  {
    id: 29,
    name: "에도",
  },
  {
    id: 30,
    name: "이스탄불",
  },
  {
    id: 31,
    name: "자카르타",
  },
  {
    id: 32,
    name: "잔지바르",
  },
  {
    id: 33,
    name: "제노바",
  },
  {
    id: 34,
    name: "중경",
  },
  {
    id: 35,
    name: "캘리컷",
  },
  {
    id: 36,
    name: "케이프타운",
  },
  {
    id: 37,
    name: "튀니스",
  },
  {
    id: 38,
    name: "포르토벨로",
  },
  {
    id: 39,
    name: "피사",
  },
  {
    id: 40,
    name: "한양",
  },
];

export const JOB_PREFERRED_SKILL_OPTION_ARRAY = [
  {
    id: 2270,
    name: "고고학",
  },
  {
    id: 2271,
    name: "관찰",
  },
  {
    id: 2272,
    name: "구제",
  },
  {
    id: 2273,
    name: "구조",
  },
  {
    id: 2274,
    name: "기뢰발견",
  },
  {
    id: 2275,
    name: "낚시",
  },
  {
    id: 2276,
    name: "대화술",
  },
  {
    id: 2277,
    name: "돛 조종",
  },
  {
    id: 2278,
    name: "미술",
  },
  {
    id: 2279,
    name: "보급",
  },
  {
    id: 2280,
    name: "보물 감정",
  },
  {
    id: 2281,
    name: "생물학",
  },
  {
    id: 2282,
    name: "생존",
  },
  {
    id: 2283,
    name: "생태 조사",
  },
  {
    id: 2284,
    name: "인식",
  },
  {
    id: 2285,
    name: "자물쇠 따기",
  },
  {
    id: 2286,
    name: "조달",
  },
  {
    id: 2287,
    name: "종교학",
  },
  {
    id: 2288,
    name: "주연",
  },
  {
    id: 2289,
    name: "지리학",
  },
  {
    id: 2290,
    name: "채집",
  },
  {
    id: 2291,
    name: "측량",
  },
  {
    id: 2292,
    name: "탐색",
  },
  {
    id: 2293,
    name: "행군",
  },
  {
    id: 2294,
    name: "가축 거래",
  },
  {
    id: 2295,
    name: "경계",
  },
  {
    id: 2296,
    name: "공업품 거래",
  },
  {
    id: 2297,
    name: "공예",
  },
  {
    id: 2298,
    name: "공예품 거래",
  },
  {
    id: 2299,
    name: "광물 거래",
  },
  {
    id: 2300,
    name: "귀금속 거래",
  },
  {
    id: 2301,
    name: "기호품 거래",
  },
  {
    id: 2302,
    name: "도주",
  },
  {
    id: 2303,
    name: "무기류 거래",
  },
  {
    id: 2304,
    name: "미술품 거래",
  },
  {
    id: 2305,
    name: "바디 랭귀지",
  },
  {
    id: 2306,
    name: "보관",
  },
  {
    id: 2307,
    name: "보석 거래",
  },
  {
    id: 2308,
    name: "봉제",
  },
  {
    id: 2309,
    name: "사교",
  },
  {
    id: 2310,
    name: "섬유 거래",
  },
  {
    id: 2311,
    name: "식료품 거래",
  },
  {
    id: 2312,
    name: "염료 거래",
  },
  {
    id: 2313,
    name: "운용",
  },
  {
    id: 2314,
    name: "의약품 거래",
  },
  {
    id: 2315,
    name: "잡화 거래",
  },
  {
    id: 2316,
    name: "조리",
  },
  {
    id: 2317,
    name: "주류 거래",
  },
  {
    id: 2318,
    name: "주조",
  },
  {
    id: 2319,
    name: "직물 거래",
  },
  {
    id: 2320,
    name: "총포류 거래",
  },
  {
    id: 2321,
    name: "향료 거래",
  },
  {
    id: 2322,
    name: "향신료 거래",
  },
  {
    id: 2323,
    name: "회계",
  },
  {
    id: 2324,
    name: "감시",
  },
  {
    id: 2325,
    name: "검술",
  },
  {
    id: 2326,
    name: "관통",
  },
  {
    id: 2327,
    name: "기뢰 설치",
  },
  {
    id: 2328,
    name: "노 젓기",
  },
  {
    id: 2329,
    name: "돌격",
  },
  {
    id: 2330,
    name: "방어",
  },
  {
    id: 2331,
    name: "소화",
  },
  {
    id: 2332,
    name: "속사",
  },
  {
    id: 2333,
    name: "수리",
  },
  {
    id: 2334,
    name: "수탈",
  },
  {
    id: 2335,
    name: "수평사격",
  },
  {
    id: 2336,
    name: "외과의술",
  },
  {
    id: 2337,
    name: "원군요청",
  },
  {
    id: 2338,
    name: "응급처치",
  },
  {
    id: 2339,
    name: "전술",
  },
  {
    id: 2340,
    name: "접현",
  },
  {
    id: 2341,
    name: "조선",
  },
  {
    id: 2342,
    name: "조타",
  },
  {
    id: 2343,
    name: "질병학",
  },
  {
    id: 2344,
    name: "총격",
  },
  {
    id: 2345,
    name: "탄도학",
  },
  {
    id: 2346,
    name: "통솔",
  },
  {
    id: 2347,
    name: "포술",
  },
  {
    id: 2348,
    name: "회피",
  },
  {
    id: 2354,
    name: "라틴어",
  },
  {
    id: 2369,
    name: "조미료 거래",
  },
  {
    id: 2425,
    name: "바이올린 연주",
  },
  {
    id: 2426,
    name: "해군 호위 요청",
  },
  {
    id: 2430,
    name: "항해기술",
  },
  {
    id: 2431,
    name: "던지기 기술",
  },
  {
    id: 2432,
    name: "관리기술",
  },
  {
    id: 2433,
    name: "응용검술",
  },
  {
    id: 2434,
    name: "병기기술",
  },
  {
    id: 2435,
    name: "저격술",
  },
  {
    id: 2436,
    name: "연금술",
  },
  {
    id: 2441,
    name: "언어학",
  },
  {
    id: 2444,
    name: "인양",
  },
  {
    id: 2445,
    name: "예항",
  },
  {
    id: 2452,
    name: "상품지식",
  },
  {
    id: 2453,
    name: "함정",
  },
  {
    id: 137755,
    name: "천문학",
  },
  {
    id: 1016435,
    name: "활 쏘기",
  },
  {
    id: 1518281,
    name: "조교",
  },
];

export const EQUIPMENT_SKILL_OPTION_ARRAY = [
  {
    id: 2270,
    name: "고고학",
  },
  {
    id: 2273,
    name: "구조",
  },
  {
    id: 2274,
    name: "기뢰발견",
  },
  {
    id: 2275,
    name: "낚시",
  },
  {
    id: 2276,
    name: "대화술",
  },
  {
    id: 2277,
    name: "돛 조종",
  },
  {
    id: 2278,
    name: "미술",
  },
  {
    id: 2279,
    name: "보급",
  },
  {
    id: 2280,
    name: "보물 감정",
  },
  {
    id: 2281,
    name: "생물학",
  },
  {
    id: 2282,
    name: "생존",
  },
  {
    id: 2283,
    name: "생태 조사",
  },
  {
    id: 2284,
    name: "인식",
  },
  {
    id: 2285,
    name: "자물쇠 따기",
  },
  {
    id: 2286,
    name: "조달",
  },
  {
    id: 2287,
    name: "종교학",
  },
  {
    id: 2288,
    name: "주연",
  },
  {
    id: 2289,
    name: "지리학",
  },
  {
    id: 2290,
    name: "채집",
  },
  {
    id: 2291,
    name: "측량",
  },
  {
    id: 2292,
    name: "탐색",
  },
  {
    id: 2293,
    name: "행군",
  },
  {
    id: 2294,
    name: "가축 거래",
  },
  {
    id: 2295,
    name: "경계",
  },
  {
    id: 2296,
    name: "공업품 거래",
  },
  {
    id: 2297,
    name: "공예",
  },
  {
    id: 2298,
    name: "공예품 거래",
  },
  {
    id: 2299,
    name: "광물 거래",
  },
  {
    id: 2300,
    name: "귀금속 거래",
  },
  {
    id: 2301,
    name: "기호품 거래",
  },
  {
    id: 2303,
    name: "무기류 거래",
  },
  {
    id: 2304,
    name: "미술품 거래",
  },
  {
    id: 2305,
    name: "바디 랭귀지",
  },
  {
    id: 2306,
    name: "보관",
  },
  {
    id: 2307,
    name: "보석 거래",
  },
  {
    id: 2308,
    name: "봉제",
  },
  {
    id: 2309,
    name: "사교",
  },
  {
    id: 2310,
    name: "섬유 거래",
  },
  {
    id: 2311,
    name: "식료품 거래",
  },
  {
    id: 2312,
    name: "염료 거래",
  },
  {
    id: 2313,
    name: "운용",
  },
  {
    id: 2314,
    name: "의약품 거래",
  },
  {
    id: 2315,
    name: "잡화 거래",
  },
  {
    id: 2316,
    name: "조리",
  },
  {
    id: 2317,
    name: "주류 거래",
  },
  {
    id: 2318,
    name: "주조",
  },
  {
    id: 2319,
    name: "직물 거래",
  },
  {
    id: 2320,
    name: "총포류 거래",
  },
  {
    id: 2321,
    name: "향료 거래",
  },
  {
    id: 2322,
    name: "향신료 거래",
  },
  {
    id: 2323,
    name: "회계",
  },
  {
    id: 2324,
    name: "감시",
  },
  {
    id: 2325,
    name: "검술",
  },
  {
    id: 2326,
    name: "관통",
  },
  {
    id: 2327,
    name: "기뢰 설치",
  },
  {
    id: 2328,
    name: "노 젓기",
  },
  {
    id: 2329,
    name: "돌격",
  },
  {
    id: 2330,
    name: "방어",
  },
  {
    id: 2331,
    name: "소화",
  },
  {
    id: 2332,
    name: "속사",
  },
  {
    id: 2333,
    name: "수리",
  },
  {
    id: 2334,
    name: "수탈",
  },
  {
    id: 2335,
    name: "수평사격",
  },
  {
    id: 2336,
    name: "외과의술",
  },
  {
    id: 2338,
    name: "응급처치",
  },
  {
    id: 2339,
    name: "전술",
  },
  {
    id: 2340,
    name: "접현",
  },
  {
    id: 2341,
    name: "조선",
  },
  {
    id: 2342,
    name: "조타",
  },
  {
    id: 2344,
    name: "총격",
  },
  {
    id: 2345,
    name: "탄도학",
  },
  {
    id: 2346,
    name: "통솔",
  },
  {
    id: 2347,
    name: "포술",
  },
  {
    id: 2348,
    name: "회피",
  },
  {
    id: 2369,
    name: "조미료 거래",
  },
  {
    id: 2430,
    name: "항해기술",
  },
  {
    id: 2431,
    name: "던지기 기술",
  },
  {
    id: 2432,
    name: "관리기술",
  },
  {
    id: 2433,
    name: "응용검술",
  },
  {
    id: 2434,
    name: "병기기술",
  },
  {
    id: 2435,
    name: "저격술",
  },
  {
    id: 2436,
    name: "연금술",
  },
  {
    id: 2441,
    name: "언어학",
  },
  {
    id: 2444,
    name: "인양",
  },
  {
    id: 2445,
    name: "예항",
  },
  {
    id: 2452,
    name: "상품지식",
  },
  {
    id: 2453,
    name: "함정",
  },
  {
    id: 137755,
    name: "천문학",
  },
  {
    id: 1016435,
    name: "활 쏘기",
  },
  {
    id: 1518281,
    name: "조교",
  },
  {
    id: 2960935,
    name: "화약학",
  },
];

export const TREASUREMAP_CATEGORY_ARRAY = [
  "서고",
  "육지 재조사",
  "NPC",
  "퀘스트",
  "이벤트",
];

export const TREASUREMAP_ACADEMIC_FIELD_ARRAY = [
  "생물학",
  "고고학",
  "보물감정",
  "종교학",
  "미술",
  "지리학",
  "천문학",
];

export const TREASUREMAP_LIBRARY_ARRAY = [
  "그랜드케이맨",
  "나폴리",
  "런던",
  "리마",
  "리스본",
  "마르세이유",
  "베네치아",
  "사카이",
  "상트 페테르부르크",
  "샌프란시스코",
  "세비야",
  "아테네",
  "안평",
  "알렉산드리아",
  "암보이나",
  "암스테르담",
  "윌렘스타트",
  "이스탄불",
  "제노바",
  "카라카스",
  "카옌",
  "캘리컷",
  "테르나테",
  "튀니스",
  "트루히요",
  "페르남부쿠",
  "한양",
  "항주",
];

export const NPCSALE_LOCATION_ARRAY = [
  { id: 11650, name: "간디아" },
  { id: 11682, name: "고어" },
  { id: 11755, name: "과테말라" },
  { id: 11761, name: "리마" },
  { id: 11764, name: "괌" },
  { id: 11723, name: "그랜드케이맨" },
  { id: 11718, name: "리우데자네이루" },
  { id: 25007, name: "그레이트플레인스" },
  { id: 11694, name: "그로닝겐" },
  { id: 11782, name: "길드 개척도시" },
  { id: 11772, name: "나가사키" },
  { id: 11724, name: "나소" },
  { id: 11698, name: "나탈" },
  { id: 11641, name: "나폴리" },
  { id: 11615, name: "낭트" },
  { id: 11740, name: "다바오" },
  { id: 11771, name: "단수이" },
  { id: 11693, name: "단치히" },
  { id: 11613, name: "더블린" },
  { id: 11610, name: "도버" },
  { id: 11708, name: "도파르" },
  { id: 11706, name: "두알라" },
  { id: 11683, name: "디우" },
  { id: 11743, name: "딜리" },
  { id: 11647, name: "라구사" },
  { id: 11624, name: "라스팔마스" },
  { id: 11717, name: "바이아" },
  { id: 11741, name: "마닐라" },
  { id: 11766, name: "사마라이" },
  { id: 11727, name: "아체" },
  { id: 11757, name: "람바예케" },
  { id: 11732, name: "자카르타" },
  { id: 11609, name: "런던" },
  { id: 11744, name: "잠비" },
  { id: 11773, name: "사카이" },
  { id: 11783, name: "로마" },
  { id: 11738, name: "로프부리" },
  { id: 11665, name: "루안다" },
  { id: 11770, name: "안평" },
  { id: 11736, name: "룬" },
  { id: 11604, name: "뤼베크" },
  { id: 11599, name: "리가" },
  { id: 11619, name: "리스본" },
  { id: 11774, name: "에도" },
  { id: 11767, name: "한양" },
  { id: 11776, name: "항주" },
  { id: 1268158, name: "보스턴" },
  { id: 11622, name: "마데이라" },
  { id: 11721, name: "마라카이보" },
  { id: 11632, name: "마르세이유" },
  { id: 11675, name: "마사와" },
  { id: 11686, name: "마술리파탐" },
  { id: 11763, name: "마추픽추" },
  { id: 11735, name: "마카사르" },
  { id: 11779, name: "마카오" },
  { id: 11627, name: "말라가" },
  { id: 240930, name: "샌프란시스코" },
  { id: 11668, name: "소팔라" },
  { id: 11667, name: "케이프타운" },
  { id: 11730, name: "말라카" },
  { id: 11707, name: "말린디" },
  { id: 11715, name: "메리다" },
  { id: 11673, name: "모가디슈" },
  { id: 11669, name: "모잠비크" },
  { id: 11672, name: "몸바사" },
  { id: 11631, name: "몽펠리에" },
  { id: 11677, name: "무스카트" },
  { id: 11630, name: "바르셀로나" },
  { id: 11679, name: "바스라" },
  { id: 11674, name: "아덴" },
  { id: 11733, name: "반자르마신" },
  { id: 11628, name: "발렌시아" },
  { id: 11759, name: "발파라이소" },
  { id: 11705, name: "베냉" },
  { id: 11643, name: "베네치아" },
  { id: 11701, name: "제다" },
  { id: 11681, name: "코친" },
  { id: 11713, name: "베라크루스" },
  { id: 11663, name: "세인트조지스" },
  { id: 11602, name: "베르겐" },
  { id: 11656, name: "베이루트" },
  { id: 11695, name: "벵가지" },
  { id: 11697, name: "벵겔라" },
  { id: 11616, name: "보르도" },
  { id: 11768, name: "부산" },
  { id: 11714, name: "부에노스아이레스" },
  { id: 11703, name: "브레멘" },
  { id: 11661, name: "시에라리온" },
  { id: 11742, name: "브루나이" },
  { id: 11702, name: "비스뷔" },
  { id: 11635, name: "사사리" },
  { id: 11716, name: "산안토니오" },
  { id: 11688, name: "산토도밍고" },
  { id: 11704, name: "세바스토폴" },
  { id: 11653, name: "알렉산드리아" },
  { id: 11657, name: "이스탄불" },
  { id: 11690, name: "산티아고" },
  { id: 11689, name: "산후안" },
  { id: 11651, name: "살로니카" },
  { id: 11664, name: "상투메" },
  { id: 59391, name: "상트 페테르부르크" },
  { id: 11621, name: "세비야" },
  { id: 11626, name: "세우타" },
  { id: 11709, name: "세이라" },
  { id: 11654, name: "카이로" },
  { id: 11700, name: "소코트라" },
  { id: 11659, name: "트레비존드" },
  { id: 11734, name: "수라바야" },
  { id: 11676, name: "수에즈" },
  { id: 11600, name: "스톡홀름" },
  { id: 11642, name: "시라쿠사" },
  { id: 11652, name: "파마구스타" },
  { id: 11684, name: "실론" },
  { id: 11606, name: "암스테르담" },
  { id: 11625, name: "아르긴" },
  { id: 11662, name: "아비장" },
  { id: 11725, name: "아조레스" },
  { id: 11754, name: "아카풀코" },
  { id: 11648, name: "아테네" },
  { id: 11644, name: "안코나" },
  { id: 11608, name: "앤트워프" },
  { id: 11638, name: "알제" },
  { id: 11611, name: "에딘버러" },
  { id: 11601, name: "오슬로" },
  { id: 11745, name: "암보이나" },
  { id: 31993, name: "코콜라" },
  { id: 11612, name: "플리머스" },
  { id: 11655, name: "야파" },
  { id: 11605, name: "함부르크" },
  { id: 11607, name: "헤르데르" },
  { id: 11696, name: "오데사" },
  { id: 1016317, name: "로테르담" },
  { id: 11784, name: "옥스포드" },
  { id: 11751, name: "왕가누이" },
  { id: 11775, name: "운대산" },
  { id: 11720, name: "윌렘스타트" },
  { id: 1016417, name: "르아브르" },
  { id: 11646, name: "자다르" },
  { id: 11691, name: "자메이카" },
  { id: 1016888, name: "빌바오" },
  { id: 11671, name: "잔지바르" },
  { id: 60947, name: "제너두" },
  { id: 11633, name: "제노바" },
  { id: 11777, name: "중경" },
  { id: 11728, name: "지아딘" },
  { id: 11778, name: "천주" },
  { id: 11719, name: "카라카스" },
  { id: 11666, name: "카리비브" },
  { id: 11660, name: "카보베르데" },
  { id: 11623, name: "카사블랑카" },
  { id: 11711, name: "카옌" },
  { id: 1016423, name: "맨체스터" },
  { id: 11749, name: "카카두" },
  { id: 11658, name: "카파" },
  { id: 11614, name: "칼레" },
  { id: 11636, name: "칼리아리" },
  { id: 11634, name: "칼비" },
  { id: 11680, name: "캘리컷" },
  { id: 11687, name: "캘커타" },
  { id: 11603, name: "코펜하겐" },
  { id: 11760, name: "코피아포" },
  { id: 11752, name: "쿠가리" },
  { id: 11762, name: "쿠스코" },
  { id: 11739, name: "쿠칭" },
  { id: 11699, name: "킬와" },
  { id: 11670, name: "타마타브" },
  { id: 11737, name: "테노치티틀란" },
  { id: 11746, name: "테르나테" },
  { id: 11758, name: "툼베스" },
  { id: 11639, name: "튀니스" },
  { id: 11722, name: "트루히요" },
  { id: 11645, name: "트리에스테" },
  { id: 11640, name: "트리폴리" },
  { id: 11756, name: "파나마" },
  { id: 11620, name: "파루" },
  { id: 11780, name: "파리" },
  { id: 11729, name: "파타니" },
  { id: 11731, name: "팔렘방" },
  { id: 11629, name: "팔마" },
  { id: 11726, name: "페구" },
  { id: 11712, name: "페르남부쿠" },
  { id: 11710, name: "포르토벨로" },
  { id: 11618, name: "포르투" },
  { id: 60980, name: "포트 로얄" },
  { id: 11769, name: "포항" },
  { id: 11685, name: "퐁디셰리" },
  { id: 29365, name: "프랑크 프루트" },
  { id: 11781, name: "피렌체" },
  { id: 11637, name: "피사" },
  { id: 11753, name: "핀자라" },
  { id: 11692, name: "하바나" },
  { id: 23541, name: "하와이" },
  { id: 1016591, name: "비아나두카스텔루" },
  { id: 1801042, name: "사그레스" },
  { id: 11678, name: "호르무즈" },
  { id: 11750, name: "호바트" },
  { id: 11747, name: "홀로" },
  { id: 11765, name: "히바오아" },
  { id: 11617, name: "히혼" },
  { id: 12236, name: "콜로세움" },
  { id: 34503, name: "아부심벨 신전 중계층" },
  { id: 138603, name: "아부심벨 신전 심계층" },
  { id: 34490, name: "기자 피라미드 중계층" },
  { id: 34488, name: "기자 피라미드 상계층" },
  { id: 34492, name: "기자 피라미드 심계층" },
  { id: 34498, name: "룩소르 신전 심계층" },
  { id: 34494, name: "룩소르 신전 상계층" },
  { id: 34496, name: "룩소르 신전 중계층" },
  { id: 23109, name: "가나돌 사령부" },
  { id: 240928, name: "타코마" },
  { id: 875700, name: "아크로폴리스" },
  { id: 1016704, name: "포츠머스" },
  { id: 1016487, name: "코토르" },
  { id: 1021780, name: "암스테르담 상인조합" },
  { id: 1021793, name: "암스테르담 해양조합" },
  { id: 12121, name: "암스테르담 모험가조합" },
  { id: 1024951, name: "런던 모험가조합" },
  { id: 1024953, name: "런던 상인조합" },
  { id: 1024955, name: "런던 해양조합" },
  { id: 1024957, name: "리스본 모험가조합" },
  { id: 1024960, name: "리스본 상인조합" },
  { id: 1024962, name: "리스본 해양조합" },
  { id: 1024964, name: "세비야 모험가조합" },
  { id: 1024966, name: "세비야 상인조합" },
  { id: 1024968, name: "세비야 해양조합" },
  { id: 971358, name: "마르세이유 모험가조합" },
  { id: 1024970, name: "마르세이유 상인조합" },
  { id: 1024972, name: "마르세이유 해양조합" },
  { id: 1024974, name: "제노바 모험가조합" },
  { id: 1024976, name: "제노바 상인조합" },
  { id: 1024978, name: "제노바 해양조합" },
  { id: 1024980, name: "튀니스 모험가조합" },
  { id: 1024982, name: "튀니스 상인조합" },
  { id: 1024984, name: "튀니스 해양조합" },
  { id: 1024986, name: "나폴리 모험가조합" },
  { id: 1024988, name: "나폴리 상인조합" },
  { id: 1024990, name: "나폴리 해양조합" },
  { id: 1024992, name: "베네치아 모험가조합" },
  { id: 1024994, name: "베네치아 상인조합" },
  { id: 1024996, name: "베네치아 해양조합" },
  { id: 1024998, name: "아테네 모험가조합" },
  { id: 1025000, name: "아테네 상인조합" },
  { id: 1025002, name: "아테네 해양조합" },
  { id: 1025004, name: "알렉산드리아 모험가조합" },
  { id: 1025006, name: "알렉산드리아 상인조합" },
  { id: 1025008, name: "알렉산드리아 해양조합" },
  { id: 1025010, name: "이스탄불 모험가조합" },
  { id: 1025012, name: "이스탄불 상인조합" },
  { id: 1025014, name: "이스탄불 해양조합" },
  { id: 1025016, name: "캘리컷 모험가조합" },
  { id: 1025018, name: "캘리컷 상인조합" },
  { id: 1025020, name: "캘리컷 해양조합" },
  { id: 1025022, name: "상트 페테르부르크 모험가조합" },
  { id: 1025024, name: "상트 페테르부르크 상인조합" },
  { id: 1025026, name: "상트 페테르부르크 해양조합" },
  { id: 381255, name: "샌프란시스코 종합 조합" },
  { id: 1268164, name: "오마하" },
  { id: 1268162, name: "새크라멘토" },
  { id: 1909542, name: "망갈" },
  { id: 1909426, name: "가봉" },
  { id: 1909502, name: "이냠바느" },
  { id: 2237199, name: "작전본부" },
  { id: 3430341, name: "비샤카파트남" },
  { id: 3430005, name: "얀부" },
  { id: 3430226, name: "마나마" },
  { id: 3558110, name: "예테보리" },
];

export const SHIP_PURPOSE_ARRAY = [
  { id: 1, name: "전투용" },
  { id: 2, name: "모험용" },
  { id: 3, name: "교역용" },
];

export const SHIP_SIZE_ARRAY = [
  { id: 1, name: "소형1" },
  { id: 2, name: "소형2" },
  { id: 3, name: "중형" },
  { id: 4, name: "대형1" },
  { id: 5, name: "대형2" },
];

export const SHIP_PROPULSION_ARRAY = [
  { id: 1, name: "갤리" },
  { id: 2, name: "범선" },
  { id: 3, name: "증기선" },
];

export const SHIP_SKILL_OPTION_ARRAY = [
  "강화포문",
  "고층 감시대",
  "급가속",
  "기뢰제거",
  "백병전 회피",
  "특수기뢰",
  "강화기뢰",
  "사령탑",
  "침투방지망",
  "특수연막탄",
  "내풍마스트",
  "예항 보조",
  "투망",
  "표류물 탐색",
  "굉음기뢰",
  "내포격장갑",
  "중량포격",
  "특수선미루",
  "파괴공작",
  "폭탄 장치",
  "조타강화",
  "선제공격",
  "직격저지",
  "집중장전",
  "내화벽",
  "부관실",
  "일반사치품 보관고",
  "강화창고",
  "고급사치품 보관고",
  "공장제품 보관고",
  "일용품 보관고",
  "반동타",
  "수밀격벽",
  "충돌 회피",
  "장갑열화탄",
  "노 젓기보조",
  "선박관리실",
  "갑판 장벽",
  "돛수선 기술",
  "연대강화",
  "집중수리",
  "배수펌프",
  "충각전술",
  "양호실",
  "위장창고",
  "회계실",
  "상급 선실",
  "공작실",
  "방화공격",
  "특수충각",
  "남만 무역 우대",
  "내진창고",
  "기뢰 탐색",
  "강화키",
  "군함 위장",
  "서재",
  "오락실",
  "철갑탄",
  "조리실",
  "백병전 요격",
  "수리지원",
  "의료지원",
  "강습 갑판전",
  "강화충각",
  "견제 포격",
  "불 선박 기폭",
  "내파장갑",
  "구명정",
  "자료실",
  "가축실",
  "작렬탄",
  "투묘기뢰",
  "조리 기술 연구소",
];
