// export a an array of json object with field (id, name)
export const QUEST_FILTER_SKILL_ARRAY = [
  {
    id: 2270,
    name: "고고학",
  },
  {
    id: 2275,
    name: "낚시",
  },
  {
    id: 2277,
    name: "돛 조종",
  },
  {
    id: 2278,
    name: "미술",
  },
  {
    id: 2280,
    name: "보물 감정",
  },
  {
    id: 2281,
    name: "생물학",
  },
  {
    id: 2282,
    name: "생존",
  },
  {
    id: 2283,
    name: "생태 조사",
  },
  {
    id: 2284,
    name: "인식",
  },
  {
    id: 2285,
    name: "자물쇠 따기",
  },
  {
    id: 2286,
    name: "조달",
  },
  {
    id: 2287,
    name: "종교학",
  },
  {
    id: 2289,
    name: "지리학",
  },
  {
    id: 2290,
    name: "채집",
  },
  {
    id: 2292,
    name: "탐색",
  },
  {
    id: 2293,
    name: "행군",
  },
  {
    id: 2294,
    name: "가축 거래",
  },
  {
    id: 2295,
    name: "경계",
  },
  {
    id: 2297,
    name: "공예",
  },
  {
    id: 2298,
    name: "공예품 거래",
  },
  {
    id: 2300,
    name: "귀금속 거래",
  },
  {
    id: 2301,
    name: "기호품 거래",
  },
  {
    id: 2306,
    name: "보관",
  },
  {
    id: 2307,
    name: "보석 거래",
  },
  {
    id: 2308,
    name: "봉제",
  },
  {
    id: 2309,
    name: "사교",
  },
  {
    id: 2313,
    name: "운용",
  },
  {
    id: 2314,
    name: "의약품 거래",
  },
  {
    id: 2316,
    name: "조리",
  },
  {
    id: 2317,
    name: "주류 거래",
  },
  {
    id: 2318,
    name: "주조",
  },
  {
    id: 2322,
    name: "향신료 거래",
  },
  {
    id: 2323,
    name: "회계",
  },
  {
    id: 2324,
    name: "감시",
  },
  {
    id: 2325,
    name: "검술",
  },
  {
    id: 2326,
    name: "관통",
  },
  {
    id: 2328,
    name: "노 젓기",
  },
  {
    id: 2329,
    name: "돌격",
  },
  {
    id: 2333,
    name: "수리",
  },
  {
    id: 2334,
    name: "수탈",
  },
  {
    id: 2335,
    name: "수평사격",
  },
  {
    id: 2336,
    name: "외과의술",
  },
  {
    id: 2338,
    name: "응급처치",
  },
  {
    id: 2339,
    name: "전술",
  },
  {
    id: 2344,
    name: "총격",
  },
  {
    id: 2345,
    name: "탄도학",
  },
  {
    id: 2346,
    name: "통솔",
  },
  {
    id: 2347,
    name: "포술",
  },
  {
    id: 2348,
    name: "회피",
  },
  {
    id: 2349,
    name: "고대 이집트어",
  },
  {
    id: 2350,
    name: "그리스어",
  },
  {
    id: 2351,
    name: "네덜란드어",
  },
  {
    id: 2352,
    name: "노르웨이어",
  },
  {
    id: 2353,
    name: "독일어",
  },
  {
    id: 2354,
    name: "라틴어",
  },
  {
    id: 2355,
    name: "서아프리카어",
  },
  {
    id: 2356,
    name: "스와힐리어",
  },
  {
    id: 2357,
    name: "스페인어",
  },
  {
    id: 2358,
    name: "슬라브어",
  },
  {
    id: 2359,
    name: "아라비아어",
  },
  {
    id: 2360,
    name: "영어",
  },
  {
    id: 2361,
    name: "이탈리아어",
  },
  {
    id: 2362,
    name: "인도어",
  },
  {
    id: 2363,
    name: "켈트어",
  },
  {
    id: 2364,
    name: "터키어",
  },
  {
    id: 2365,
    name: "포르투갈어",
  },
  {
    id: 2366,
    name: "프랑스어",
  },
  {
    id: 2367,
    name: "헤브라이어",
  },
  {
    id: 2368,
    name: "페르시아어",
  },
  {
    id: 2429,
    name: "마야어",
  },
  {
    id: 2430,
    name: "항해기술",
  },
  {
    id: 2431,
    name: "던지기 기술",
  },
  {
    id: 2432,
    name: "관리기술",
  },
  {
    id: 2433,
    name: "응용검술",
  },
  {
    id: 2434,
    name: "병기기술",
  },
  {
    id: 2435,
    name: "저격술",
  },
  {
    id: 2436,
    name: "연금술",
  },
  {
    id: 2438,
    name: "크메르어",
  },
  {
    id: 2439,
    name: "말레이 타갈로그어",
  },
  {
    id: 2440,
    name: "태국 미얀마어",
  },
  {
    id: 2442,
    name: "나우아틀어",
  },
  {
    id: 2444,
    name: "인양",
  },
  {
    id: 2448,
    name: "오세아니아어",
  },
  {
    id: 2449,
    name: "케추아어",
  },
  {
    id: 2451,
    name: "조선어",
  },
  {
    id: 2452,
    name: "상품지식",
  },
  {
    id: 2453,
    name: "함정",
  },
  {
    id: 2454,
    name: "중국어",
  },
  {
    id: 2455,
    name: "일본어",
  },
  {
    id: 2457,
    name: "북미어",
  },
  {
    id: 59426,
    name: "북극어",
  },
  {
    id: 137755,
    name: "천문학",
  },
  {
    id: 1518281,
    name: "조교",
  },
];

// id 값은 대충 아무렇게나 넣음. 주의필요
export const QUEST_FILTER_LOCATION_ARRAY = [
  {
    id: 1,
    name: "간디아",
  },
  {
    id: 2,
    name: "그로닝겐",
  },
  {
    id: 3,
    name: "길드 개척도시",
  },
  {
    id: 4,
    name: "나폴리",
  },
  {
    id: 5,
    name: "런던",
  },
  {
    id: 6,
    name: "리마",
  },
  {
    id: 7,
    name: "리스본",
  },
  {
    id: 8,
    name: "리우데자네이루",
  },
  {
    id: 9,
    name: "마닐라",
  },
  {
    id: 10,
    name: "마르세이유",
  },
  {
    id: 11,
    name: "베네치아",
  },
  {
    id: 12,
    name: "부산",
  },
  {
    id: 13,
    name: "사그레스",
  },
  {
    id: 14,
    name: "산토도밍고",
  },
  {
    id: 15,
    name: "산티아고",
  },
  {
    id: 16,
    name: "상트 페테르부르크",
  },
  {
    id: 17,
    name: "샌프란시스코",
  },
  {
    id: 18,
    name: "세비야",
  },
  {
    id: 19,
    name: "세우타",
  },
  {
    id: 20,
    name: "세인트조지스",
  },
  {
    id: 21,
    name: "스톡홀름",
  },
  {
    id: 22,
    name: "시라쿠사",
  },
  {
    id: 23,
    name: "아덴",
  },
  {
    id: 24,
    name: "아크로폴리스",
  },
  {
    id: 25,
    name: "아테네",
  },
  {
    id: 26,
    name: "안평",
  },
  {
    id: 27,
    name: "알렉산드리아",
  },
  {
    id: 28,
    name: "암스테르담",
  },
  {
    id: 29,
    name: "에도",
  },
  {
    id: 30,
    name: "이스탄불",
  },
  {
    id: 31,
    name: "자카르타",
  },
  {
    id: 32,
    name: "잔지바르",
  },
  {
    id: 33,
    name: "제노바",
  },
  {
    id: 34,
    name: "중경",
  },
  {
    id: 35,
    name: "캘리컷",
  },
  {
    id: 36,
    name: "케이프타운",
  },
  {
    id: 37,
    name: "튀니스",
  },
  {
    id: 38,
    name: "포르토벨로",
  },
  {
    id: 39,
    name: "피사",
  },
  {
    id: 40,
    name: "한양",
  },
];

export const JOB_PREFERRED_SKILL_OPTION_ARRAY = [
  {
    id: 2270,
    name: "고고학",
  },
  {
    id: 2271,
    name: "관찰",
  },
  {
    id: 2272,
    name: "구제",
  },
  {
    id: 2273,
    name: "구조",
  },
  {
    id: 2274,
    name: "기뢰발견",
  },
  {
    id: 2275,
    name: "낚시",
  },
  {
    id: 2276,
    name: "대화술",
  },
  {
    id: 2277,
    name: "돛 조종",
  },
  {
    id: 2278,
    name: "미술",
  },
  {
    id: 2279,
    name: "보급",
  },
  {
    id: 2280,
    name: "보물 감정",
  },
  {
    id: 2281,
    name: "생물학",
  },
  {
    id: 2282,
    name: "생존",
  },
  {
    id: 2283,
    name: "생태 조사",
  },
  {
    id: 2284,
    name: "인식",
  },
  {
    id: 2285,
    name: "자물쇠 따기",
  },
  {
    id: 2286,
    name: "조달",
  },
  {
    id: 2287,
    name: "종교학",
  },
  {
    id: 2288,
    name: "주연",
  },
  {
    id: 2289,
    name: "지리학",
  },
  {
    id: 2290,
    name: "채집",
  },
  {
    id: 2291,
    name: "측량",
  },
  {
    id: 2292,
    name: "탐색",
  },
  {
    id: 2293,
    name: "행군",
  },
  {
    id: 2294,
    name: "가축 거래",
  },
  {
    id: 2295,
    name: "경계",
  },
  {
    id: 2296,
    name: "공업품 거래",
  },
  {
    id: 2297,
    name: "공예",
  },
  {
    id: 2298,
    name: "공예품 거래",
  },
  {
    id: 2299,
    name: "광물 거래",
  },
  {
    id: 2300,
    name: "귀금속 거래",
  },
  {
    id: 2301,
    name: "기호품 거래",
  },
  {
    id: 2302,
    name: "도주",
  },
  {
    id: 2303,
    name: "무기류 거래",
  },
  {
    id: 2304,
    name: "미술품 거래",
  },
  {
    id: 2305,
    name: "바디 랭귀지",
  },
  {
    id: 2306,
    name: "보관",
  },
  {
    id: 2307,
    name: "보석 거래",
  },
  {
    id: 2308,
    name: "봉제",
  },
  {
    id: 2309,
    name: "사교",
  },
  {
    id: 2310,
    name: "섬유 거래",
  },
  {
    id: 2311,
    name: "식료품 거래",
  },
  {
    id: 2312,
    name: "염료 거래",
  },
  {
    id: 2313,
    name: "운용",
  },
  {
    id: 2314,
    name: "의약품 거래",
  },
  {
    id: 2315,
    name: "잡화 거래",
  },
  {
    id: 2316,
    name: "조리",
  },
  {
    id: 2317,
    name: "주류 거래",
  },
  {
    id: 2318,
    name: "주조",
  },
  {
    id: 2319,
    name: "직물 거래",
  },
  {
    id: 2320,
    name: "총포류 거래",
  },
  {
    id: 2321,
    name: "향료 거래",
  },
  {
    id: 2322,
    name: "향신료 거래",
  },
  {
    id: 2323,
    name: "회계",
  },
  {
    id: 2324,
    name: "감시",
  },
  {
    id: 2325,
    name: "검술",
  },
  {
    id: 2326,
    name: "관통",
  },
  {
    id: 2327,
    name: "기뢰 설치",
  },
  {
    id: 2328,
    name: "노 젓기",
  },
  {
    id: 2329,
    name: "돌격",
  },
  {
    id: 2330,
    name: "방어",
  },
  {
    id: 2331,
    name: "소화",
  },
  {
    id: 2332,
    name: "속사",
  },
  {
    id: 2333,
    name: "수리",
  },
  {
    id: 2334,
    name: "수탈",
  },
  {
    id: 2335,
    name: "수평사격",
  },
  {
    id: 2336,
    name: "외과의술",
  },
  {
    id: 2337,
    name: "원군요청",
  },
  {
    id: 2338,
    name: "응급처치",
  },
  {
    id: 2339,
    name: "전술",
  },
  {
    id: 2340,
    name: "접현",
  },
  {
    id: 2341,
    name: "조선",
  },
  {
    id: 2342,
    name: "조타",
  },
  {
    id: 2343,
    name: "질병학",
  },
  {
    id: 2344,
    name: "총격",
  },
  {
    id: 2345,
    name: "탄도학",
  },
  {
    id: 2346,
    name: "통솔",
  },
  {
    id: 2347,
    name: "포술",
  },
  {
    id: 2348,
    name: "회피",
  },
  {
    id: 2354,
    name: "라틴어",
  },
  {
    id: 2369,
    name: "조미료 거래",
  },
  {
    id: 2425,
    name: "바이올린 연주",
  },
  {
    id: 2426,
    name: "해군 호위 요청",
  },
  {
    id: 2430,
    name: "항해기술",
  },
  {
    id: 2431,
    name: "던지기 기술",
  },
  {
    id: 2432,
    name: "관리기술",
  },
  {
    id: 2433,
    name: "응용검술",
  },
  {
    id: 2434,
    name: "병기기술",
  },
  {
    id: 2435,
    name: "저격술",
  },
  {
    id: 2436,
    name: "연금술",
  },
  {
    id: 2441,
    name: "언어학",
  },
  {
    id: 2444,
    name: "인양",
  },
  {
    id: 2445,
    name: "예항",
  },
  {
    id: 2452,
    name: "상품지식",
  },
  {
    id: 2453,
    name: "함정",
  },
  {
    id: 137755,
    name: "천문학",
  },
  {
    id: 1016435,
    name: "활 쏘기",
  },
  {
    id: 1518281,
    name: "조교",
  },
];

export const EQUIPMENT_SKILL_OPTION_ARRAY = [
  {
    id: 2270,
    name: "고고학",
  },
  {
    id: 2273,
    name: "구조",
  },
  {
    id: 2274,
    name: "기뢰발견",
  },
  {
    id: 2275,
    name: "낚시",
  },
  {
    id: 2276,
    name: "대화술",
  },
  {
    id: 2277,
    name: "돛 조종",
  },
  {
    id: 2278,
    name: "미술",
  },
  {
    id: 2279,
    name: "보급",
  },
  {
    id: 2280,
    name: "보물 감정",
  },
  {
    id: 2281,
    name: "생물학",
  },
  {
    id: 2282,
    name: "생존",
  },
  {
    id: 2283,
    name: "생태 조사",
  },
  {
    id: 2284,
    name: "인식",
  },
  {
    id: 2285,
    name: "자물쇠 따기",
  },
  {
    id: 2286,
    name: "조달",
  },
  {
    id: 2287,
    name: "종교학",
  },
  {
    id: 2288,
    name: "주연",
  },
  {
    id: 2289,
    name: "지리학",
  },
  {
    id: 2290,
    name: "채집",
  },
  {
    id: 2291,
    name: "측량",
  },
  {
    id: 2292,
    name: "탐색",
  },
  {
    id: 2293,
    name: "행군",
  },
  {
    id: 2294,
    name: "가축 거래",
  },
  {
    id: 2295,
    name: "경계",
  },
  {
    id: 2296,
    name: "공업품 거래",
  },
  {
    id: 2297,
    name: "공예",
  },
  {
    id: 2298,
    name: "공예품 거래",
  },
  {
    id: 2299,
    name: "광물 거래",
  },
  {
    id: 2300,
    name: "귀금속 거래",
  },
  {
    id: 2301,
    name: "기호품 거래",
  },
  {
    id: 2303,
    name: "무기류 거래",
  },
  {
    id: 2304,
    name: "미술품 거래",
  },
  {
    id: 2305,
    name: "바디 랭귀지",
  },
  {
    id: 2306,
    name: "보관",
  },
  {
    id: 2307,
    name: "보석 거래",
  },
  {
    id: 2308,
    name: "봉제",
  },
  {
    id: 2309,
    name: "사교",
  },
  {
    id: 2310,
    name: "섬유 거래",
  },
  {
    id: 2311,
    name: "식료품 거래",
  },
  {
    id: 2312,
    name: "염료 거래",
  },
  {
    id: 2313,
    name: "운용",
  },
  {
    id: 2314,
    name: "의약품 거래",
  },
  {
    id: 2315,
    name: "잡화 거래",
  },
  {
    id: 2316,
    name: "조리",
  },
  {
    id: 2317,
    name: "주류 거래",
  },
  {
    id: 2318,
    name: "주조",
  },
  {
    id: 2319,
    name: "직물 거래",
  },
  {
    id: 2320,
    name: "총포류 거래",
  },
  {
    id: 2321,
    name: "향료 거래",
  },
  {
    id: 2322,
    name: "향신료 거래",
  },
  {
    id: 2323,
    name: "회계",
  },
  {
    id: 2324,
    name: "감시",
  },
  {
    id: 2325,
    name: "검술",
  },
  {
    id: 2326,
    name: "관통",
  },
  {
    id: 2327,
    name: "기뢰 설치",
  },
  {
    id: 2328,
    name: "노 젓기",
  },
  {
    id: 2329,
    name: "돌격",
  },
  {
    id: 2330,
    name: "방어",
  },
  {
    id: 2331,
    name: "소화",
  },
  {
    id: 2332,
    name: "속사",
  },
  {
    id: 2333,
    name: "수리",
  },
  {
    id: 2334,
    name: "수탈",
  },
  {
    id: 2335,
    name: "수평사격",
  },
  {
    id: 2336,
    name: "외과의술",
  },
  {
    id: 2338,
    name: "응급처치",
  },
  {
    id: 2339,
    name: "전술",
  },
  {
    id: 2340,
    name: "접현",
  },
  {
    id: 2341,
    name: "조선",
  },
  {
    id: 2342,
    name: "조타",
  },
  {
    id: 2344,
    name: "총격",
  },
  {
    id: 2345,
    name: "탄도학",
  },
  {
    id: 2346,
    name: "통솔",
  },
  {
    id: 2347,
    name: "포술",
  },
  {
    id: 2348,
    name: "회피",
  },
  {
    id: 2369,
    name: "조미료 거래",
  },
  {
    id: 2430,
    name: "항해기술",
  },
  {
    id: 2431,
    name: "던지기 기술",
  },
  {
    id: 2432,
    name: "관리기술",
  },
  {
    id: 2433,
    name: "응용검술",
  },
  {
    id: 2434,
    name: "병기기술",
  },
  {
    id: 2435,
    name: "저격술",
  },
  {
    id: 2436,
    name: "연금술",
  },
  {
    id: 2441,
    name: "언어학",
  },
  {
    id: 2444,
    name: "인양",
  },
  {
    id: 2445,
    name: "예항",
  },
  {
    id: 2452,
    name: "상품지식",
  },
  {
    id: 2453,
    name: "함정",
  },
  {
    id: 137755,
    name: "천문학",
  },
  {
    id: 1016435,
    name: "활 쏘기",
  },
  {
    id: 1518281,
    name: "조교",
  },
  {
    id: 2960935,
    name: "화약학",
  },
];

export const TREASUREMAP_CATEGORY_ARRAY = [
  {
    id: 1,
    name: "발견물 지도",
  },
  {
    id: 2,
    name: "침몰선 지도",
  },
];

export const ACADEMIC_FIELD_ARRAY = [
  {
    id: 1,
    name: "고고학",
  },
  {
    id: 2,
    name: "종교학",
  },
  {
    id: 3,
    name: "미술",
  },
  {
    id: 4,
    name: "지리학",
  },
  {
    id: 5,
    name: "생물학",
  },
  {
    id: 6,
    name: "보물 감정",
  },
];

export const LIBRARY_ARRAY = [
  {
    id: 1,
    name: "리스본",
  },
  {
    id: 2,
    name: "세비야",
  },
  {
    id: 3,
    name: "런던",
  },
  {
    id: 4,
    name: "암스테르담",
  },
  {
    id: 5,
    name: "베네치아",
  },
  {
    id: 6,
    name: "마르세이유",
  },
];

