// export a an array of json object with field (id, name)
export const QUEST_FILTER_SKILL_ARRAY = [
  {
    "id": 2270,
    "name": "고고학"
  },
  {
    "id": 2275,
    "name": "낚시"
  },
  {
    "id": 2277,
    "name": "돛 조종"
  },
  {
    "id": 2278,
    "name": "미술"
  },
  {
    "id": 2280,
    "name": "보물 감정"
  },
  {
    "id": 2281,
    "name": "생물학"
  },
  {
    "id": 2282,
    "name": "생존"
  },
  {
    "id": 2283,
    "name": "생태 조사"
  },
  {
    "id": 2284,
    "name": "인식"
  },
  {
    "id": 2285,
    "name": "자물쇠 따기"
  },
  {
    "id": 2286,
    "name": "조달"
  },
  {
    "id": 2287,
    "name": "종교학"
  },
  {
    "id": 2289,
    "name": "지리학"
  },
  {
    "id": 2290,
    "name": "채집"
  },
  {
    "id": 2292,
    "name": "탐색"
  },
  {
    "id": 2293,
    "name": "행군"
  },
  {
    "id": 2294,
    "name": "가축 거래"
  },
  {
    "id": 2295,
    "name": "경계"
  },
  {
    "id": 2297,
    "name": "공예"
  },
  {
    "id": 2298,
    "name": "공예품 거래"
  },
  {
    "id": 2300,
    "name": "귀금속 거래"
  },
  {
    "id": 2301,
    "name": "기호품 거래"
  },
  {
    "id": 2306,
    "name": "보관"
  },
  {
    "id": 2307,
    "name": "보석 거래"
  },
  {
    "id": 2308,
    "name": "봉제"
  },
  {
    "id": 2309,
    "name": "사교"
  },
  {
    "id": 2313,
    "name": "운용"
  },
  {
    "id": 2314,
    "name": "의약품 거래"
  },
  {
    "id": 2316,
    "name": "조리"
  },
  {
    "id": 2317,
    "name": "주류 거래"
  },
  {
    "id": 2318,
    "name": "주조"
  },
  {
    "id": 2322,
    "name": "향신료 거래"
  },
  {
    "id": 2323,
    "name": "회계"
  },
  {
    "id": 2324,
    "name": "감시"
  },
  {
    "id": 2325,
    "name": "검술"
  },
  {
    "id": 2326,
    "name": "관통"
  },
  {
    "id": 2328,
    "name": "노 젓기"
  },
  {
    "id": 2329,
    "name": "돌격"
  },
  {
    "id": 2333,
    "name": "수리"
  },
  {
    "id": 2334,
    "name": "수탈"
  },
  {
    "id": 2335,
    "name": "수평사격"
  },
  {
    "id": 2336,
    "name": "외과의술"
  },
  {
    "id": 2338,
    "name": "응급처치"
  },
  {
    "id": 2339,
    "name": "전술"
  },
  {
    "id": 2344,
    "name": "총격"
  },
  {
    "id": 2345,
    "name": "탄도학"
  },
  {
    "id": 2346,
    "name": "통솔"
  },
  {
    "id": 2347,
    "name": "포술"
  },
  {
    "id": 2348,
    "name": "회피"
  },
  {
    "id": 2349,
    "name": "고대 이집트어"
  },
  {
    "id": 2350,
    "name": "그리스어"
  },
  {
    "id": 2351,
    "name": "네덜란드어"
  },
  {
    "id": 2352,
    "name": "노르웨이어"
  },
  {
    "id": 2353,
    "name": "독일어"
  },
  {
    "id": 2354,
    "name": "라틴어"
  },
  {
    "id": 2355,
    "name": "서아프리카어"
  },
  {
    "id": 2356,
    "name": "스와힐리어"
  },
  {
    "id": 2357,
    "name": "스페인어"
  },
  {
    "id": 2358,
    "name": "슬라브어"
  },
  {
    "id": 2359,
    "name": "아라비아어"
  },
  {
    "id": 2360,
    "name": "영어"
  },
  {
    "id": 2361,
    "name": "이탈리아어"
  },
  {
    "id": 2362,
    "name": "인도어"
  },
  {
    "id": 2363,
    "name": "켈트어"
  },
  {
    "id": 2364,
    "name": "터키어"
  },
  {
    "id": 2365,
    "name": "포르투갈어"
  },
  {
    "id": 2366,
    "name": "프랑스어"
  },
  {
    "id": 2367,
    "name": "헤브라이어"
  },
  {
    "id": 2368,
    "name": "페르시아어"
  },
  {
    "id": 2429,
    "name": "마야어"
  },
  {
    "id": 2430,
    "name": "항해기술"
  },
  {
    "id": 2431,
    "name": "던지기 기술"
  },
  {
    "id": 2432,
    "name": "관리기술"
  },
  {
    "id": 2433,
    "name": "응용검술"
  },
  {
    "id": 2434,
    "name": "병기기술"
  },
  {
    "id": 2435,
    "name": "저격술"
  },
  {
    "id": 2436,
    "name": "연금술"
  },
  {
    "id": 2438,
    "name": "크메르어"
  },
  {
    "id": 2439,
    "name": "말레이 타갈로그어"
  },
  {
    "id": 2440,
    "name": "태국 미얀마어"
  },
  {
    "id": 2442,
    "name": "나우아틀어"
  },
  {
    "id": 2444,
    "name": "인양"
  },
  {
    "id": 2448,
    "name": "오세아니아어"
  },
  {
    "id": 2449,
    "name": "케추아어"
  },
  {
    "id": 2451,
    "name": "조선어"
  },
  {
    "id": 2452,
    "name": "상품지식"
  },
  {
    "id": 2453,
    "name": "함정"
  },
  {
    "id": 2454,
    "name": "중국어"
  },
  {
    "id": 2455,
    "name": "일본어"
  },
  {
    "id": 2457,
    "name": "북미어"
  },
  {
    "id": 59426,
    "name": "북극어"
  },
  {
    "id": 137755,
    "name": "천문학"
  },
  {
    "id": 1518281,
    "name": "조교"
  }
];